In [45]:
import pandas as pd

In [46]:
people={'first':['Coery','Jane','John'],
      'last':['Schafer','Doe','Doe'],
       'email':['CoeryMSchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com']
     }

In [47]:
df=pd.DataFrame(people)

In [48]:
df

   first     last                    email
0  Coery  Schafer  CoeryMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

# Combine and Add columns

In [49]:
# Combine first and last columns into one as full_name column

In [50]:
df['full_name']=df['first']+' '+df['last'] #

In [51]:
df

   first     last                    email      full_name
0  Coery  Schafer  CoeryMSchafer@gmail.com  Coery Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

# Removing columns

In [52]:
df.drop(columns=['first','last'], inplace=True)

In [53]:
df

                     email      full_name
0  CoeryMSchafer@gmail.com  Coery Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

# Spliting one column into multiple columns

In [54]:
# Convert full_name column into first and last column

In [55]:
df['full_name'].str.split()   #If we don't specify any split value, then by default it cosider space(' ').
                              # And return list of value

0    [Coery, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [56]:
# It returns list of spliting values , so split it into multiple columns we have to use 'expand' attribute

In [57]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Coery  Schafer
1   Jane      Doe
2   John      Doe

In [58]:
# By default return column value as integer value start from 0 to len split value,

# But we can make column name as our choice

In [59]:
df[['first','last']]=df['full_name'].str.split(' ', expand=True )

In [60]:
df

                     email      full_name  first     last
0  CoeryMSchafer@gmail.com  Coery Schafer  Coery  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

# Add a single column value into a row

In [61]:
df.append({'first':'tony'})     #Can only append a dict if ignore_index=True

TypeError: Can only append a dict if ignore_index=True

In [62]:
df.append({'first':'tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoeryMSchafer@gmail.com  Coery Schafer  Coery  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   tony      NaN

# Add Two data frames

In [63]:
people2={'first':['Tony','Steve'],
      'last':['Stark','Roger'],
       'email':['ironman@aveng.com','cap@aveng.com']
     }

In [64]:
df2=pd.DataFrame(people2)

In [65]:
df2

   first   last              email
0   Tony  Stark  ironman@aveng.com
1  Steve  Roger      cap@aveng.com

In [66]:
# append df2 to df

In [67]:
df.append(df2)

                     email      full_name  first     last
0  CoeryMSchafer@gmail.com  Coery Schafer  Coery  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
0        ironman@aveng.com            NaN   Tony    Stark
1            cap@aveng.com            NaN  Steve    Roger

In [68]:
df.append(df2, sort=True)    # Whole dataframe will sort

                     email  first      full_name     last
0  CoeryMSchafer@gmail.com  Coery  Coery Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
0        ironman@aveng.com   Tony            NaN    Stark
1            cap@aveng.com  Steve            NaN    Roger

In [69]:
df

                     email      full_name  first     last
0  CoeryMSchafer@gmail.com  Coery Schafer  Coery  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [70]:
# If we want to change our original dataframe permanently

In [71]:
df.append(df2, sort=True, inplace=True) # inplace attribute not working with append method

TypeError: append() got an unexpected keyword argument 'inplace'

In [72]:
# So for that,

In [75]:
df=df.append(df2, ignore_index=True, sort=True)  # If we don't add ignore_index=True, then index value also append

In [76]:
df

                     email  first      full_name     last
0  CoeryMSchafer@gmail.com  Coery  Coery Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
3        ironman@aveng.com   Tony            NaN    Stark
4            cap@aveng.com  Steve            NaN    Roger
5        ironman@aveng.com   Tony            NaN    Stark
6            cap@aveng.com  Steve            NaN    Roger

# Removing Rows

In [ ]:
# If we want to delete a specific row by its index

# Syntax : <Data Frame name>.drop(index=<index number>)

In [77]:
df.drop(index=[4,5,6])

                     email  first      full_name     last
0  CoeryMSchafer@gmail.com  Coery  Coery Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
3        ironman@aveng.com   Tony            NaN    Stark

In [78]:
df

                     email  first      full_name     last
0  CoeryMSchafer@gmail.com  Coery  Coery Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
3        ironman@aveng.com   Tony            NaN    Stark
4            cap@aveng.com  Steve            NaN    Roger
5        ironman@aveng.com   Tony            NaN    Stark
6            cap@aveng.com  Steve            NaN    Roger

In [79]:
#Q. Remove the where last name Roger

In [106]:
filt=df['last']=='Roger'

In [107]:
df[filt]

           email  first full_name   last
4  cap@aveng.com  Steve       NaN  Roger
6  cap@aveng.com  Steve       NaN  Roger

In [109]:
df.drop(index=df[filt].index)      # index attribute, It will return list of index values.

                     email  first      full_name     last
0  CoeryMSchafer@gmail.com  Coery  Coery Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
3        ironman@aveng.com   Tony            NaN    Stark
5        ironman@aveng.com   Tony            NaN    Stark